In [1]:
import pandas as pd
from sqlalchemy import create_engine
cnx = create_engine('postgresql://postgres:dat18nyc@52.0.213.100:5432/lahman')
query = """SELECT * FROM salaries LIMIT 10"""
pd.read_sql_query(query, cnx)

   yearid teamid lgid   playerid  salary
0    1985    ATL   NL  barkele01  870000
1    1985    ATL   NL  bedrost01  550000
2    1985    ATL   NL  benedbr01  545000
3    1985    ATL   NL   campri01  633333
4    1985    ATL   NL  ceronri01  625000
5    1985    ATL   NL  chambch01  800000
6    1985    ATL   NL  dedmoje01  150000
7    1985    ATL   NL  forstte01  483333
8    1985    ATL   NL  garbege01  772000
9    1985    ATL   NL  harpete01  250000

In [2]:
sql = pd.read_sql_query(query, cnx)
sql.head()
#1.Show all playerids and salaries with a salary in the year 1985 above 500k.
query1 = """SELECT playerid, salary FROM salaries where yearid >1985 and salary  > 500000"""
pd.read_sql_query(query1, cnx).head()

    playerid  salary
0  barkele01  880000
1  benedbr01  565000
2   campri01  600000
3  chambch01  769452
4  garbege01  786667

In [3]:
#2.Show the team for each year that had a rank of 1.
query2 = """SELECT distinct teamid FROM teams where teams.rank = 1"""
pd.read_sql_query(query2, cnx).head()

  teamid
0    ML4
1    NYA
2    PIT
3    SLF
4    BOS

In [4]:
#3. How many schools are in schoolstate of CT?
query3 = """SELECT * FROM schools where schoolstate = 'CT'"""
pd.read_sql_query(query3, cnx).head()

,schoolid,schoolname,schoolcity,schoolstate,schoolnick
0,bridgeport,University of Bridgeport,Bridgeport,CT,USA
1,cconnst,Central Connecticut State University,New Britain,CT,USA
2,ctconap,University of Connecticut at Avery Point,Groton,CT,USA
3,ctmitch,Mitchell College,New London,CT,USA
4,ctnorwa,Norwalk Community College,Norwalk,CT,USA

In [5]:
#4.How many schools are there in each state?
query4 = """SELECT schoolstate, count(schoolname) FROM schools group by schoolstate"""
pd.read_sql_query(query4, cnx).head()

  schoolstate  count
0          PA     72
1          AZ     14
2          FL     58
3          LA     17
4          NM      7

In [6]:
#5.What was the total spend on salaries by each team, each year?
query5 = """SELECT yearid, teamid from teams group by yearid, teamid""" 
pd.read_sql_query(query5, cnx).head()

   yearid teamid
0    1914    BRF
1    2008    ATL
2    1960    PIT
3    2014    DET
4    1927    SLN

In [7]:
#6.Find all of the salaries of shortstops (fieldings, pos) for the year 2012.
query6 = """SELECT fielding.pos, fielding.playerid, fielding.teamid, salaries.salary  
FROM fielding 
join salaries on salaries.playerid = fielding.playerid where fielding.yearid = 2012 and fielding.pos='SS'"""
pd.read_sql_query(query6, cnx).head()

  pos   playerid teamid   salary
0  SS  amarial01    SDN   511100
1  SS  amarial01    SDN   497400
2  SS  amarial01    SDN   481000
3  SS  andinro01    BAL  1600000
4  SS  andinro01    BAL  1300000

In [26]:
#7.What is the first and last year played for each player?
query7 = """SELECT playerid, min(yearid), max(yearid)
FROM collegeplaying
GROUP BY playerid"""
pd.read_sql_query(query7, cnx).head()

    playerid   min   max
0  putkolu01  2006  2007
1  fritzla01  1969  1969
2  russoke01  2005  2006
3  ruckejo01  1936  1938
4  gibbojo01  1955  1957

In [27]:
#8.Who has played the most all star games?
query = """SELECT playerid, count(*) FROM allstarfull group by playerid order by count desc limit 1"""
pd.read_sql_query(query, cnx).head()

    playerid  count
0  aaronha01     25

In [125]:
#9.Which school has generated the most distinct players?
query9 = """
SELECT MAX(count) AS Most_Distinct_Players FROM
(SELECT schoolid, count(distinct(playerid)) 
FROM collegeplaying
GROUP BY schoolid) AS TEMP"""

q9_pandas = pd.read_sql_query(query9, cnx)

q9_pandas

   most_distinct_players
0                    107

In [22]:
query9 = """
SELECT *
From salaries
"""
q9_pandas = pd.read_sql_query(query9, cnx)
q9_pandas.head()

   yearid teamid lgid   playerid  salary
0    1985    ATL   NL  barkele01  870000
1    1985    ATL   NL  bedrost01  550000
2    1985    ATL   NL  benedbr01  545000
3    1985    ATL   NL   campri01  633333
4    1985    ATL   NL  ceronri01  625000

In [44]:
#10.Which school has generated the most expensive players? 
#(expensive defined by their first year's salary).
#teamid, salary, yearid, lgid	playerid
#left join collegeplaying c
#on c.playerid = A.playerid

query10 = """
select a.playerid, a.mini, b.salary from
(SELECT playerid, min(yearid) mini
FROM salaries s1
GROUP BY playerid
order by playerid) a
inner join salaries b 
on a.playerid = b.playerid
and a.mini = b.yearid 
inner join collegeplaying c
on b.playerid = c.playerid
and a.mini = c.yearid
order by b.salary desc

"""
q10_pandas = pd.read_sql_query(query10, cnx)
q10_pandas

    playerid  mini  salary
0  tuckeed01  1988  125000
1  anderbr02  1993  109000
2  loyndmi01  1986   60000
3  swindgr01  1986   60000

In [20]:
##no sure about this one
#11.Show the 5 most expensive salaries for each team in the year 2014.
query11 = """
select *
    from (
        SELECT
            teamid,
            salary,
            rank() over (PARTITION BY teamid ORDER BY salary desc) as Rank
            FROM salaries
    ) t where Rank <= 5

"""
q11 = pd.read_sql_query(query10, cnx)
q11

,playerid,min,yearid,teamid,lgid,playerid,salary,playerid,schoolid,yearid
0,abadan01,2006,2006,CIN,NL,abadan01,327000,abadan01,gamiddl,1993
1,abadan01,2006,2006,CIN,NL,abadan01,327000,abadan01,gamiddl,1992
2,abbotje01,1998,1998,CHA,AL,abbotje01,175000,abbotje01,kentucky,1994
3,abbotje01,1998,1998,CHA,AL,abbotje01,175000,abbotje01,kentucky,1992
4,abbotje01,1998,1998,CHA,AL,abbotje01,175000,abbotje01,kentucky,1991
5,abbotky01,1992,1992,PHI,NL,abbotky01,109000,abbotky01,longbeach,1989
6,abbotky01,1992,1992,PHI,NL,abbotky01,109000,abbotky01,ucsd,1988
7,abbotky01,1992,1992,PHI,NL,abbotky01,109000,abbotky01,ucsd,1987
8,abercre01,2006,2006,FLO,NL,abercre01,327000,abercre01,flgateway,2000
9,ackledu01,2012,2012,SEA,AL,ackledu01,2100000,ackledu01,unc,2009
10,ackledu01,2012,2012,SEA,AL,ackledu01,2100000,ackledu01,unc,2008
11,ackledu01,2012,2012,SEA,AL,ackledu01,2100000,ackledu01,unc,2007
12,adamsjo02,1997,1997,ML4,AL,adamsjo02,151000,adamsjo02,cacerri,1990
13,adamsma01,2013,2013,SLN,NL,adamsma01,490000,adamsma01,sliprock,2009
14,adamsma01,2013,2013,SLN,NL,adamsma01,490000,adamsma01,sliprock,2008
15,adamsma01,2013,2013,SLN,NL,adamsma01,490000,adamsma01,sliprock,2007
16,adducji01,1987,1987,ML4,AL,adducji01,70000,adducji01,sillinois,1980
17,adducji01,1987,1987,ML4,AL,adducji01,70000,adducji01,sillinois,1979
18,adducji01,1987,1987,ML4,AL,adducji01,70000,adducji01,sillinois,1978
19,adkinjo01,2004,2004,CHA,AL,adkinjo01,301000,adkinjo01,okstate,1998
20,adkinjo01,2004,2004,CHA,AL,adkinjo01,301000,adkinjo01,okstate,1997
21,adkinjo01,2004,2004,CHA,AL,adkinjo01,301000,adkinjo01,okstate,1996
22,afenitr01,1990,1990,OAK,AL,afenitr01,100000,afenitr01,capalom,1983
23,afenitr01,1990,1990,OAK,AL,afenitr01,100000,afenitr01,capalom,1982
24,agbaybe01,1999,1999,NYN,NL,agbaybe01,200000,agbaybe01,hawaiipac,1993
25,agbaybe01,1999,1999,NYN,NL,agbaybe01,200000,agbaybe01,hawaiipac,1992
26,agbaybe01,1999,1999,NYN,NL,agbaybe01,200000,agbaybe01,hawaiipac,1991
27,albaljo01,2008,2008,NYA,AL,albaljo01,393225,albaljo01,miamidade,2001
28,alberma01,2008,2008,BAL,AL,alberma01,395000,alberma01,txsjjcn,2002
29,aldremi01,1986,1986,SFN,NL,aldremi01,60000,aldremi01,stanford,1983
...,...,...,...,...,...,...,...,...,...,...
7296,youngma01,1985,1985,SEA,AL,youngma01,159000,youngma01,capasad,1977
7297,youngmi02,2002,2002,TEX,AL,youngmi02,250000,youngmi02,ucsb,1997
7298,youngmi02,2002,2002,TEX,AL,youngmi02,250000,youngmi02,ucsb,1996
7299,youngmi02,2002,2002,TEX,AL,youngmi02,250000,youngmi02,ucsb,1995
7300,youngmi02,2002,2002,TEX,AL,youngmi02,250000,youngmi02,ucsb,1994
7301,zahnge01,1985,1985,CAL,AL,zahnge01,550000,zahnge01,michigan,1967
7302,zahnge01,1985,1985,CAL,AL,zahnge01,550000,zahnge01,michigan,1966
7303,zerbech01,2003,2003,SFN,NL,zerbech01,317000,zerbech01,flhills,1991
7304,zimmeje02,1999,1999,TEX,AL,zimmeje02,200000,zimmeje02,txchrist,1993
7305,zimmeje02,1999,1999,TEX,AL,zimmeje02,200000,zimmeje02,txchrist,1992
7306,zimmeje02,1999,1999,TEX,AL,zimmeje02,200000,zimmeje02,ortreas,1990
7307,zimmejo01,2010,2010,WAS,NL,zimmejo01,401000,zimmejo01,txblinn,1995
7308,zimmejo01,2010,2010,WAS,NL,zimmejo01,401000,zimmejo01,txblinn,1994
7309,zimmejo02,2011,2011,WAS,NL,zimmejo02,415000,zimmejo02,wistvnspt,2007
7310,zimmejo02,2011,2011,WAS,NL,zimmejo02,415000,zimmejo02,wistvnspt,2006
7311,zimmejo02,2011,2011,WAS,NL,zimmejo02,415000,zimmejo02,wistvnspt,2005
7312,zitoba01,2001,2001,OAK,AL,zitoba01,240000,zitoba01,usc,1999
7313,zitoba01,2001,2001,OAK,AL,zitoba01,240000,zitoba01,capierc,1998
7314,zitoba01,2001,2001,OAK,AL,zitoba01,240000,zitoba01,ucsb,1997
7315,zobribe01,2007,2007,TBA,AL,zobribe01,383400,zobribe01,dallasbapt,2004
7316,zobribe01,2007,2007,TBA,AL,zobribe01,383400,zobribe01,olivetnaz,2003
7317,zobribe01,2007,2007,TBA,AL,zobribe01,383400,zobribe01,olivetnaz,2002
7318,zobribe01,2007,2007,TBA,AL,zobribe01,383400,zobribe01,olivetnaz,2001
7319,zoskyed01,1992,1992,TOR,AL,zoskyed01,109000,zoskyed01,fresnost,1989
7320,zoskyed01,1992,1992,TOR,AL,zoskyed01,109000,zoskyed01,fresnost,1988
7321,zoskyed01,1992,1992,TOR,AL,zoskyed01,109000,zoskyed01,fresnost,1987
7322,zuvelpa01,1989,1989,ATL,NL,zuvelpa01,145000,zuvelpa01,stanford,1980
7323,zuvelpa01,1989,1989,ATL,NL,zuvelpa01,145000,zuvelpa01,stanford,1979
7324,zuvelpa01,1989,1989,ATL,NL,zuvelpa01,145000,zuvelpa01,stanford,1978
7325,zuvelpa01,1989,1989,ATL,NL,zuvelpa01,145000,zuvelpa01,stanford,1977

In [21]:

#12 Partition the average salaries by team and year, against year. 
#Find players that were paid more than 1 standard deviation above the average salary for that team and year. 
#Show a count by playerid.

query12 = """
select count(*)
    from (
        SELECT
            *,
            AVG(salary) over (PARTITION BY teamid, yearid) + STDDEV(salary) over (PARTITION BY teamid, yearid) as temp          
            FROM salaries
    ) t where t.salary > temp

"""
q12 = pd.read_sql_query(query12, cnx)
q12.tail()

   count
0   3875

In [55]:
#13. Calculate the win percentage. 
#convert w and g into numerics (floats) to do so. (w::numeric, for example)
## which one is the win percentage here? w from the below table divide by ...? 

query13 = """
select *
from teams
"""

q13 = pd.read_sql_query(query13, cnx)
q13.tail()

,yearid,lgid,teamid,franchid,divid,rank,g,ghome,w,l,...,dp,fp,name,park,attendance,bpf,ppf,teamidbr,teamidlahman45,teamidretro
2770,2014,NL,SLN,STL,C,1,162,81,90,72,...,145,0.985,St. Louis Cardinals,Busch Stadium III,3540649,101,100,STL,SLN,SLN
2771,2014,AL,TBA,TBD,E,4,162,81,77,85,...,96,0.985,Tampa Bay Rays,Tropicana Field,1446464,97,97,TBR,TBA,TBA
2772,2014,AL,TEX,TEX,W,5,162,81,67,95,...,155,0.982,Texas Rangers,Rangers Ballpark in Arlington,2718733,101,101,TEX,TEX,TEX
2773,2014,AL,TOR,TOR,E,3,162,81,83,79,...,130,0.985,Toronto Blue Jays,Rogers Centre,2375525,102,102,TOR,TOR,TOR
2774,2014,NL,WAS,WSN,E,1,162,81,96,66,...,139,0.984,Washington Nationals,Nationals Park,2579389,104,102,WSN,MON,WAS

In [ ]:
#rank() the total spend by team each year against their actual rank that year. 
#Is there a correlation of spend to performance?